import { Container } from '@/design-system';
import { TextVariants } from '@/features/text-variants';
import { TextWeight } from '@/features/text-weight';
import { TextAlign } from '@/features/text-align';
import { VerticalAlign } from '@/features/vertical-align';
import { TextColors } from '@/features/text-colors';

const TypographyPage = () => {
  return (
    <Container>
      <TextVariants />
      <TextWeight />
      <TextAlign />
      <TextAlign />
      <VerticalAlign />
      <TextColors />
      {/* <Text as="h1" mb={36}>
        Typography
      </Text>

      <Text as="h1" variant="success">
        Заголовки
      </Text>
      <Text as="h1">Специальный кредит </Text>
      <Text as="h2">Специальный кредит </Text>
      <Text as="h3">Специальный кредит </Text>
      <Text as="h4">Специальный кредит </Text>
      <Text as="h5">Специальный кредит </Text>
      <Text as="h6">Специальный кредит </Text>

      <Text as="p">
        Ясность нашей позиции очевидна: понимание сути ресурсосберегающих
        технологий играет важную роль в формировании переосмысления
        внешнеэкономических политик. Равным образом, социально-экономическое
        развитие способствует повышению качества системы обучения кадров,
        соответствующей насущным потребностям. В частности,
        социально-экономическое развитие говорит о возможностях прогресса
        профессионального сообщества. Задача организации, в особенности же
        глубокий уровень погружения предоставляет широкие возможности для
        позиций, занимаемых участниками в отношении поставленных задач. Не
        следует, однако, забывать, что высокотехнологичная концепция
        общественного уклада, а также свежий взгляд на привычные вещи —
        безусловно открывает новые горизонты для новых предложений. Таким
        образом, семантический разбор внешних противодействий предопределяет
        высокую востребованность экономической целесообразности принимаемых
        решений. Как уже неоднократно упомянуто, представители современных
        социальных резервов преданы социально-демократической анафеме.
        Картельные сговоры не допускают ситуации, при которой элементы
        политического процесса, которые представляют собой яркий пример
        континентально-европейского типа политической культуры, будут указаны
        как претенденты на роль ключевых факторов. Кстати, представители
        современных социальных резервов являются только методом политического
        участия и разоблачены.
      </Text>

      <Text as="p">
        Идейные соображения высшего порядка, а также укрепление и развитие
        структуры играет важную роль в формировании существенных финансовых и
        административных условий.
      </Text>

      <Text as="h2">Заголовок второго уровня</Text>
      <Text as="p">
        Идейные соображения высшего порядка, а также укрепление и развитие
        структуры играет важную роль в формировании существенных финансовых и
        административных условий.
      </Text>
      <Text as="p">
        Повседневная практика показывает, что укрепление и развитие структуры
        обеспечивает широкому кругу (специалистов) участие в формировании
        дальнейших направлений развития.
      </Text>

      <Text as="h3">Заголовок третьего уровня</Text>
      <Text as="p">
        Товарищи! консультация с широким активом позволяет выполнять важные
        задания по разработке систем массового участия. Товарищи! постоянное
        информационно-пропагандистское обеспечение нашей деятельности позволяет
        выполнять важные задания по разработке модели развития.
      </Text>
      <Text as="p">
        Повседневная практика показывает, что укрепление и развитие структуры
        обеспечивает широкому кругу (специалистов) участие в формировании
        дальнейших направлений развития.
      </Text>

      <Text as="h4">Заголовок четвёртого уровня</Text>
      <Text as="p">
        Повседневная практика показывает, что укрепление и развитие структуры
        обеспечивает широкому кругу (специалистов) участие в формировании
        дальнейших направлений развития.
      </Text>

      <Text as="h5">Заголовок пятого уровня</Text>
      <Text as="p">
        Идейные соображения высшего порядка, а также укрепление и развитие
        структуры играет важную роль в формировании существенных финансовых и
        административных условий.
      </Text>
      <Text as="p">
        Товарищи! консультация с широким активом позволяет выполнять важные
        задания по разработке систем массового участия. Товарищи! постоянное
        информационно-пропагандистское обеспечение нашей деятельности позволяет
        выполнять важные задания по разработке модели развития.
      </Text>

      <Text as="h6">Заголовок шестого уровня</Text>
      <Text as="p">
        Товарищи! консультация с широким активом позволяет выполнять важные
        задания по разработке систем массового участия. Товарищи! постоянное
        информационно-пропагандистское обеспечение нашей деятельности позволяет
        выполнять важные задания по разработке модели развития.
      </Text>
      <Text as="p">
        Идейные соображения высшего порядка, а также укрепление и развитие
        структуры играет важную роль в формировании существенных финансовых и
        административных условий.
      </Text> */}
    </Container>
  );
};

export default TypographyPage;
